{"activity_id":1,"activity_name":"Create","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.create","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"DLklxJwNL3dwiQSomOISfQ","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697625912524,\"_document_id\":\"DLklxJwNL3dwiQSomOISfQ\",\"action\":\"repo.create\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697625912524,\"operation_type\":\"create\",\"org\":\"tinuorgenter2\",\"org_id\":148321138,\"public_repo\":true,\"repo\":\"tinuorgenter2/Vinay_Team\",\"repo_id\":706639254,\"request_category\":\"other\",\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"visibility\":\"public\"}","severity_id":0,"status":"Success","status_id":1,"time":1697625912524,"type_name":"Web Resources Activity: Create","type_uid":600101,"web_resources":[]}
{"activity_id":3,"activity_name":"Update Configuration","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repository_vulnerability_alerts.disable","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"jY4VbIKZ65fNyEHMW6U2lA","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697625912486,\"_document_id\":\"jY4VbIKZ65fNyEHMW6U2lA\",\"action\":\"repository_vulnerability_alerts.disable\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697625912486,\"operation_type\":\"modify\",\"org\":\"tinuorgenter2\",\"org_id\":148321138,\"public_repo\":true,\"repo\":\"tinuorgenter2/Vinay_Team\",\"repo_id\":706639254,\"user\":\"vinaykattimani1\",\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"user_id\":145665387}","severity_id":0,"status":"Success","status_id":1,"time":1697625912486,"type_name":"Web Resources Activity: Update Configuration","type_uid":600103,"web_resources":[{"data":{},"type":"Configuration"}]}
{"activity_id":99,"activity_name":"Other","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.change_merge_setting","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"Giay9MZRLPiq7QLRYYKwdg","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697625911984,\"_document_id\":\"Giay9MZRLPiq7QLRYYKwdg\",\"action\":\"repo.change_merge_setting\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697625911984,\"operation_type\":\"modify\",\"org\":\"tinuorgenter2\",\"org_id\":148321138,\"public_repo\":true,\"repo\":\"tinuorgenter2/Vinay_Team\",\"repo_id\":706639254,\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"visibility\":\"public\"}","severity_id":0,"status":"Success","status_id":1,"time":1697625911984,"type_name":"Web Resources Activity: Other","type_uid":600199,"web_resources":[]}
{"activity_id":99,"activity_name":"Other","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.change_merge_setting","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"Nn9iVixYosv96bUEqn9ZfA","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697625911961,\"_document_id\":\"Nn9iVixYosv96bUEqn9ZfA\",\"action\":\"repo.change_merge_setting\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697625911961,\"operation_type\":\"modify\",\"org\":\"tinuorgenter2\",\"org_id\":148321138,\"public_repo\":true,\"repo\":\"tinuorgenter2/Vinay_Team\",\"repo_id\":706639254,\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"visibility\":\"public\"}","severity_id":0,"status":"Success","status_id":1,"time":1697625911961,"type_name":"Web Resources Activity: Other","type_uid":600199,"web_resources":[]}
