{"activity_id":1,"activity_name":"Create","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.create","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"8arfqz55V6EuDXwmDMsYIw","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697627364852,\"_document_id\":\"8arfqz55V6EuDXwmDMsYIw\",\"action\":\"repo.create\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697627364852,\"operation_type\":\"create\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":true,\"repo\":\"neworgtinu3/Vinay_TestRepo8\",\"repo_id\":706648620,\"request_category\":\"other\",\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"visibility\":\"public\"}","severity_id":0,"status":"Success","status_id":1,"time":1697627364852,"type_name":"Web Resources Activity: Create","type_uid":600101,"web_resources":[]}
{"activity_id":3,"activity_name":"Update Configuration","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repository_vulnerability_alerts.disable","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"E7vpr_K8d0P-49XLpJPwnw","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697627364818,\"_document_id\":\"E7vpr_K8d0P-49XLpJPwnw\",\"action\":\"repository_vulnerability_alerts.disable\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697627364818,\"operation_type\":\"modify\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":true,\"repo\":\"neworgtinu3/Vinay_TestRepo8\",\"repo_id\":706648620,\"user\":\"vinaykattimani1\",\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"user_id\":145665387}","severity_id":0,"status":"Success","status_id":1,"time":1697627364818,"type_name":"Web Resources Activity: Update Configuration","type_uid":600103,"web_resources":[{"data":{},"type":"Configuration"}]}
{"activity_id":99,"activity_name":"Other","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.change_merge_setting","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"RRq6g5rK6nq4p86rViV27g","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697627364343,\"_document_id\":\"RRq6g5rK6nq4p86rViV27g\",\"action\":\"repo.change_merge_setting\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697627364343,\"operation_type\":\"modify\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":true,\"repo\":\"neworgtinu3/Vinay_TestRepo8\",\"repo_id\":706648620,\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"visibility\":\"public\"}","severity_id":0,"status":"Success","status_id":1,"time":1697627364343,"type_name":"Web Resources Activity: Other","type_uid":600199,"web_resources":[]}
{"activity_id":99,"activity_name":"Other","actor":{"user":{"name":"vinaykattimani1","type":"User","type_id":1,"uid":"145665387"}},"category_name":"Application","category_uid":6,"class_name":"Web Resources Activity","class_uid":6001,"device":{"type":"Unknown","type_id":0},"metadata":{"event_code":"repo.change_merge_setting","log_provider":"AWS AppFabric","log_version":"2023-06-27","product":{"name":"Github","uid":"github","vendor_name":"Github"},"profiles":["host"],"uid":"5if7seUn9RW7vCUr13x36A","version":"v1.0.0-rc.3"},"raw_data":"{\"@timestamp\":1697627364317,\"_document_id\":\"5if7seUn9RW7vCUr13x36A\",\"action\":\"repo.change_merge_setting\",\"actor\":\"vinaykattimani1\",\"actor_id\":145665387,\"business\":\"tinuenterprise\",\"business_id\":84670,\"created_at\":1697627364317,\"operation_type\":\"modify\",\"org\":\"neworgtinu3\",\"org_id\":148334596,\"public_repo\":true,\"repo\":\"neworgtinu3/Vinay_TestRepo8\",\"repo_id\":706648620,\"user_agent\":\"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36\",\"visibility\":\"public\"}","severity_id":0,"status":"Success","status_id":1,"time":1697627364317,"type_name":"Web Resources Activity: Other","type_uid":600199,"web_resources":[]}
